Algol655/F3_BSP/F3_BSP.ioc
SPI2.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,BaudRatePrescaler,CLKPhase
SPI2.Mode=SPI_MODE_MASTER
SPI2.VirtualType=VM_MASTER
STMicroelectronics.X-CUBE-BLE2.3.2.2.ADV_INTERV_MAX=1600
STMicroelectronics.X-CUBE-BLE2.3.2.2.ADV_INTERV_MIN=1600
STMicroelectronics.X-CUBE-BLE2.3.2.2.BSP.number=4
STMicroelectronics.X-CUBE-BLE2.3.2.2.BlueNRGAa2CcWirelessJjBlueNRGAa2JjController=true
STMicroelectronics.X-CUBE-BLE2.3.2.2.BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL=Basic
STMicroelectronics.X-CUBE-BLE2.3.2.2.BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE=UserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.2.BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils=true
STMicroelectronics.X-CUBE-BLE2.3.2.2.HCI_READ_PACKET_NUM_MAX=32
STMicroelectronics.X-CUBE-BLE2.3.2.2.IPParameters=HCI_READ_PACKET_NUM_MAX,ADV_INTERV_MIN,ADV_INTERV_MAX,BlueNRGAa2CcWirelessJjBlueNRGAa2JjController,BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils,BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL,BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE
STMicroelectronics.X-CUBE-BLE2.3.2.2.WirelessJjBlueNRGAa2_Checked=true
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.api=HAL_EXTI_DRIVER
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.instance=PC4
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.mode=EXTI
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.name=Exti Line
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE2.3.2.20.BSP.solution=PC4
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.api=BSP_BUS_DRIVER
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.instance=SPI1
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.ip=SPI
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.mode=Full-Duplex Master
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.name=BUS IO driver
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE2.3.2.21.BSP.solution=SPI1
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.api=Unknown
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.instance=PC9
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.mode=Output
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.name=Reset Line
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE2.3.2.22.BSP.solution=PC9
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.STBoard=false
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.api=Unknown
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.component=
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.condition=SEMBlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACEJjUserBoard
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.i2caddr=0
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.i2creg=
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.instance=PA4
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.ip=GPIO
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.mode=Output
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.name=CS Line
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.semaphore=
STMicroelectronics.X-CUBE-BLE2.3.2.23.BSP.solution=PA4
STMicroelectronics.X-CUBE-BLE2.3.2.2_SwParameter=BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTLIiINTERFACE\:UserBoard;BlueNRGAa2CcWirelessJjBlueNRGAa2JjUtils\:true;BlueNRGAa2CcWirelessJjBlueNRGAa2JjController\:true;BlueNRGAa2CcWirelessJjBlueNRGAa2JjHCIIiTL\:Basic;
TIM1.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM1.AutomaticOutput=TIM_AUTOMATICOUTPUT_DISABLE
TIM1.BreakPolarity=TIM_BREAKPOLARITY_HIGH
TIM1.BreakState=TIM_BREAK_DISABLE
TIM1.Channel-Output\ Compare1\ No\ Output=TIM_CHANNEL_1
TIM1.Channel-Output\ Compare2\ No\ Output=TIM_CHANNEL_2
TIM1.Channel-Output\ Compare3\ No\ Output=TIM_CHANNEL_3
TIM1.Channel-Output\ Compare4\ No\ Output=TIM_CHANNEL_4
TIM1.ClockDivision=TIM_CLOCKDIVISION_DIV1
TIM1.CounterMode=TIM_COUNTERMODE_UP
TIM1.IPParameters=Prescaler,CounterMode,Period,ClockDivision,RepetitionCounter,AutoReloadPreload,TIM_MasterSlaveMode,TIM_MasterOutputTrigger,BreakState,BreakPolarity,AutomaticOutput,OffStateRunMode,OffStateIDLEMode,LockLevel,OCMode_1,Pulse-Output Compare1 No Output,OC1Preload,OCPolarity_1,OCIdleState_1,OCMode_2,Pulse-Output Compare2 No Output,OC2Preload,OCPolarity_2,OCIdleState_2,OCMode_3,Pulse-Output Compare3 No Output,OC3Preload,OCPolarity_3,OCIdleState_3,OCMode_4,Pulse-Output Compare4 No Output,OC4Preload,OCPolarity_4,OCIdleState_4,Channel-Output Compare1 No Output,Channel-Output Compare2 No Output,Channel-Output Compare3 No Output,Channel-Output Compare4 No Output
TIM1.LockLevel=TIM_LOCKLEVEL_OFF
TIM1.OC1Preload=DISABLE
TIM1.OC2Preload=DISABLE
TIM1.OC3Preload=DISABLE
TIM1.OC4Preload=DISABLE
TIM1.OCIdleState_1=TIM_OCIDLESTATE_RESET
TIM1.OCIdleState_2=TIM_OCIDLESTATE_RESET
TIM1.OCIdleState_3=TIM_OCIDLESTATE_RESET
TIM1.OCIdleState_4=TIM_OCIDLESTATE_RESET
TIM1.OCMode_1=TIM_OCMODE_TIMING
TIM1.OCMode_2=TIM_OCMODE_TIMING
TIM1.OCMode_3=TIM_OCMODE_TIMING
TIM1.OCMode_4=TIM_OCMODE_TIMING
TIM1.OCPolarity_1=TIM_OCPOLARITY_HIGH
TIM1.OCPolarity_2=TIM_OCPOLARITY_HIGH
TIM1.OCPolarity_3=TIM_OCPOLARITY_HIGH
TIM1.OCPolarity_4=TIM_OCPOLARITY_HIGH
TIM1.OffStateIDLEMode=TIM_OSSI_DISABLE
TIM1.OffStateRunMode=TIM_OSSR_DISABLE
TIM1.Period=0xFFFF
TIM1.Prescaler=16799
TIM1.Pulse-Output\ Compare1\ No\ Output=100
TIM1.Pulse-Output\ Compare2\ No\ Output=200
TIM1.Pulse-Output\ Compare3\ No\ Output=625
TIM1.Pulse-Output\ Compare4\ No\ Output=400
TIM1.RepetitionCounter=0
TIM1.TIM_MasterOutputTrigger=TIM_TRGO_RESET
TIM1.TIM_MasterSlaveMode=TIM_MASTERSLAVEMODE_DISABLE
TIM3.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM3.ClockDivision=TIM_CLOCKDIVISION_DIV1
TIM3.CounterMode=TIM_COUNTERMODE_UP
TIM3.IPParameters=Prescaler,CounterMode,Period,ClockDivision,AutoReloadPreload,TIM_MasterSlaveMode,TIM_MasterOutputTrigger
TIM3.Period=9999
TIM3.Prescaler=36000
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_RESET
TIM3.TIM_MasterSlaveMode=TIM_MASTERSLAVEMODE_DISABLE
TIM6.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM6.CounterMode=TIM_COUNTERMODE_UP
TIM6.IPParameters=Prescaler,CounterMode,Period,AutoReloadPreload,TIM_MasterOutputTrigger
TIM6.Period=9999
TIM6.Prescaler=36000
TIM6.TIM_MasterOutputTrigger=TIM_TRGO_RESET
TIM7.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_ENABLE
TIM7.IPParameters=Prescaler,Period,AutoReloadPreload
TIM7.Period=199
TIM7.Prescaler=32000
USART3.IPParameters=VirtualMode
USART3.VirtualMode=VM_ASYNC
USB_DEVICE.CLASS_NAME_FS=CDC
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS
USB_DEVICE.VirtualMode=Cdc
USB_DEVICE.VirtualModeFS=Cdc_FS
USB_OTG_FS.IPParameters=low_power_enable,vbus_sensing_enable,Sof_enable,VirtualMode
USB_OTG_FS.Sof_enable=DISABLE
USB_OTG_FS.VirtualMode=Device_Only
USB_OTG_FS.low_power_enable=DISABLE
USB_OTG_FS.vbus_sensing_enable=ENABLE
VP_ADC1_TempSens_Input.Mode=IN-TempSens
VP_ADC1_TempSens_Input.Signal=ADC1_TempSens_Input
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_RTC_VS_RTC_Calendar.Mode=RTC_Calendar
VP_RTC_VS_RTC_Calendar.Signal=RTC_VS_RTC_Calendar
VP_STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.2.Mode=WirelessJjBlueNRGAa2
VP_STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.2.Signal=STMicroelectronics.X-CUBE-BLE2_VS_WirelessJjBlueNRGAa2_3.2.2
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM1_VS_ClockSourceINT.Mode=Internal
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
VP_TIM1_VS_no_output1.Mode=Output Compare1 No Output
VP_TIM1_VS_no_output1.Signal=TIM1_VS_no_output1
VP_TIM1_VS_no_output2.Mode=Output Compare2 No Output
VP_TIM1_VS_no_output2.Signal=TIM1_VS_no_output2
VP_TIM1_VS_no_output3.Mode=Output Compare3 No Output
VP_TIM1_VS_no_output3.Signal=TIM1_VS_no_output3
VP_TIM1_VS_no_output4.Mode=Output Compare4 No Output
VP_TIM1_VS_no_output4.Signal=TIM1_VS_no_output4
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
VP_TIM6_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM6_VS_ClockSourceINT.Signal=TIM6_VS_ClockSourceINT
VP_TIM7_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM7_VS_ClockSourceINT.Signal=TIM7_VS_ClockSourceINT
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
board=F4_BSP
